app/controllers/users_controller.rb

INSERT INTO "users" ("user_name", "user_password", "user_email", "full_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_name", "Kai"], ["user_password", "test"], ["user_email", "kai@kai.com"], ["full_name", "Kai"], ["created_at", "2019-02-12 11:11:20.591813"], ["updated_at", "2019-02-12 11:11:20.591813"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save